IDEA Open Model
Parameter Class
Compatible with IDEA StatiCa 20.1
 Common parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterBool
 IdeaRS.OpenModel.CrossSection.ParameterDouble
 IdeaRS.OpenModel.CrossSection.ParameterInt
 IdeaRS.OpenModel.CrossSection.ParameterReferenceElement
 IdeaRS.OpenModel.CrossSection.ParameterString
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class Parameter : OpenObject
Public MustInherit Class Parameter
	Inherits OpenObject
The Parameter type exposes the following members.
Constructors
Name | Description
Parameter
Initializes a new instance of the Parameter class
Top
Properties
Name | Description
Name
 Name of property
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace